app/controllers/exercises_controller.rb

SELECT "exercises".* FROM "exercises"
---
    def index
        exercises = Exercise.all

SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_exercise
        exercise = Exercise.find_by(id: params[:id])