app/controllers/exercise_logs_controller.rb

SELECT "exercise_logs".* FROM "exercise_logs"
---
    def index
        render json: ExerciseLog.all, status: :ok

INSERT INTO "exercise_logs" ("user_id", "workout_id", "duration", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["workout_id", 3], ["duration", 30], ["date", 20230330], ["created_at", "2023-03-30 12:47:51.031152"], ["updated_at", "2023-03-30 12:47:51.031152"]]
---
    def create
        log = ExerciseLog.new(log_params)
        log.user_id = session[:user_id]
        log.save

SELECT "exercise_logs".* FROM "exercise_logs" WHERE "exercise_logs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        exercise_log = ExerciseLog.find_by(id: params[:id])

SELECT "exercise_logs".* FROM "exercise_logs" WHERE "exercise_logs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "exercise_logs" SET "duration" = ?, "updated_at" = ? WHERE "exercise_logs"."id" = ?  [["duration", 60], ["updated_at", "2023-03-30 12:51:03.316047"], ["id", 1]]
---
    def update
        exercise_log = ExerciseLog.find_by(id: params[:id])
        if exercise_log.update(log_params)