app/controllers/sessions_controller.rb

    def create
        user = User.find_by(username:params[:user_name])
---
SELECT "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "lorr"], ["LIMIT", 1]]