app/controllers/workouts_controller.rb

INSERT INTO "workouts" ("name", "weight", "instructor", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Leg day"], ["weight", 1], ["instructor", "Levvis May"], ["category", "Leg"], ["created_at", "2023-03-29 08:54:18.729378"], ["updated_at", "2023-03-29 08:54:18.729378"]]
---
    def create
        workout = Workout.create!(workout_params)

SELECT "workouts".* FROM "workouts"
---
    def index
        workout = Workout.all

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        workout = Workout.find(params[:id])

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "workouts" SET "name" = ?, "weight" = ?, "instructor" = ?, "category" = ?, "updated_at" = ? WHERE "workouts"."id" = ?  [["name", "Shread day"], ["weight", 0], ["instructor", "Sarah whom"], ["category", "Cardio"], ["updated_at", "2023-03-29 09:02:31.483264"], ["id", 1]]
---
    def update
        workout = Workout.find(params[:id])
        workout.update!(workout_params)

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 2]]
---
    def destroy
        workout = Workout.find(params[:id])
        workout.destroy